CSI API ETABS v1

# cAreaObjGetLocalAxes Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetLocalAxes(
    	string Name,
    	ref double Ang,
    	ref bool Advanced
    )

    Function GetLocalAxes (
    	Name As String,
    	ByRef Ang As Double,
    	ByRef Advanced As Boolean
    ) As Integer

    Dim instance As cAreaObj
    Dim Name As String
    Dim Ang As Double
    Dim Advanced As Boolean
    Dim returnValue As Integer

    returnValue = instance.GetLocalAxes(Name,
    	Ang, Advanced)

    int GetLocalAxes(
    	String^ Name,
    	double% Ang,
    	bool% Advanced
    )

    abstract GetLocalAxes :
            Name : string *
            Ang : float byref *
            Advanced : bool byref -> int

#### Parameters

Name

    Type: SystemString

Ang

    Type: SystemDouble

Advanced

    Type: SystemBoolean

#### Return Value

Type: Int32

See Also

#### Reference

cAreaObj Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com